{
  "file_path": "uploads\\f248dc42-3cce-4cef-a1b4-fb9959c7b625_question_key.pdf",
  "file_type": ".pdf",
  "raw_text": "Smart Answer Sheet Alignment and Evaluation System\n(SASES)\nBackground\nEducational institutions worldwide process millions of answer sheets annually using digital evaluation\nsystems. Despite technological advancements, two persistent challenges remain:\n• Scanned Answer Sheet Alignment – Student answer sheets often suffer from distortions\n(skew, scaling, perspective shifts, noise), leading to poor alignment with the original question\ntemplate.\n• Automated Evaluation of Structured Questions – Current systems struggle to auto-grade\nhandwritten answers for MCQs, fill-in-the-blanks, or one-word responses, resulting in manual\nintervention and reduced scalability.\nProblem Statement\nDevelopamulti-agentic AI systemthatintegratesimageprocessing,computervision,andAI/LLM\ncomponents to:\n• Automatically correctly align scanned handwritten student answer sheets to match the original\nquestion paper template.\n• Extract and evaluate answers for structured question types (MCQ, fill-in-the-blank, one-word\nresponse) by comparing them with a reference answer script.\n• Produce interpretable outputs including: aligned student sheet, transformation parameters,\nalignment accuracy, and auto-evaluation results.\nProblem Description\nWhen students’ handwritten answer sheets are scanned for digital evaluation, multiple issues compro-\nmise both the alignment and the evaluation process.\nCommon Distortions (Alignment Issues) Include:\n(cid:136) Skewness: Papers placed at angles during scanning (–15(cid:176) rotation).\n(cid:136) Perspective Distortion: Non-flat placement causing trapezoidal effects.\n(cid:136) Scale Variations: Different scanner settings or paper sizes (–10% variation).\n(cid:136) Translation Shifts: Papers not aligned with scanner edges (x,y displacement).\n1\n(cid:136) Padding/Margins: Inconsistent white space around content.\n(cid:136) Paper Deformations: Wrinkles, folds, or curves in the paper.\n(cid:136) Noise & Artifacts: Scanner dust, shadows, compression artifacts.\n(cid:136) Contrast/Brightness Variations: Due to scanning or lighting differences.\nCommon Distortions (Issues in Auto-Evaluation) Include:\n(cid:136) Handwriting Variability: Differences in writing style, spacing, and slant.\n(cid:136) Spelling Variations: Minor spelling mistakes or synonyms in fill-in-the-blank answers.\n(cid:136) Answer Positioning Errors: Writing outside designated boxes or overlapping with questions.\n(cid:136) Overwriting/Strikethroughs: Multiple attempts in the same space causing ambiguity.\n(cid:136) Multiple Markings in MCQs: Ambiguous ticks, erasures, or use of unclear symbols.\n(cid:136) Faint/Blurred Writing: Pencil answers or faint ink reducing recognition accuracy.\n(cid:136) Noise Interference: Smudges, ink bleeding, or scanning shadows.\n(cid:136) Reference Script Rigidity: Strict matching may not account for valid alternate answers.\nTechnical Requirements\nInput:\n(cid:136) Original question paper template.\n(cid:136) Scanned student answer sheet.\n(cid:136) Reference answer script.\nExpected Output:\n(cid:136) Correctly aligned answer sheet image.\n(cid:136) Transformation parameters applied.\n(cid:136) Alignment accuracy/confidence score.\n(cid:136) Auto-evaluated results with per-question marks.\nConstraints\n(cid:136) Preserve all student handwriting without loss.\n(cid:136) Support standard document formats (JPEG, PNG).\n(cid:136) Maintain resolution ≥ 300 DPI.\n(cid:136) No specialized hardware required.\n2\nBonus Challenges\n(cid:136) Multi-page support for stapled booklets.\n(cid:136) Damage recovery for torn or faded sheets.\n(cid:136) Real-time preview of alignment corrections.\n(cid:136) Handwriting readability enhancement.\n(cid:136) Automated validation: flagging uncertain cases for manual review.\n(cid:136) Explainable evaluation: showing why a response was marked correct/incorrect.\nDeliverables\n(cid:136) Working prototype/application.\n(cid:136) Source code with documentation.\n(cid:136) Test results on provided dataset.\n(cid:136) Technical approach document (with agent responsibilities).\n(cid:136) Draft of the research paper (If innovations are involved in the process)\n(cid:136) Demo video (3–5 minutes).\n3\n",
  "extraction_timestamp": "2025-10-28 19:40:37.379818"
}