{
  "file_path": "uploads\\d4f7fa4c-6860-416b-ba87-5192ef985e0f_question_key.pdf",
  "file_type": ".pdf",
  "raw_text": "Answer Key — VoidV1 Demo\nPhysics – Model Answer Key & Rubrics\nReference solutions and detailed marking scheme — step marks shown\nQ1. What is the unit of force? Define it.\nModel Answer: The SI unit of force is Newton (N).\nSteps: One Newton is defined as the force required to accelerate a mass of 1\nkilogram by 1 metre per second squared (1 m/s²). Therefore, 1 N = 1 kg·m/s².\nCommon student mistakes: Writing 'kg' as the unit of force or confusing it\nwith mass; omitting the relation 1 N = 1 kg·m/s².\nRubric:\n(cid:127) 1 mark for correctly stating the unit as 'Newton (N)'.\n(cid:127) 1 mark for giving the correct definition or formula: 1 N = 1 kg·m/s².\nTotal: 2 marks\nQ2. State Newton’s third law of motion.\nModel Answer: For every action, there is an equal and opposite reaction. When\none body exerts a force on a second body, the second body exerts an equal\nforce in the opposite direction on the first body.\nSteps: Short statement suffices; illustrate if needed: If body A exerts force\nF on body B, then B exerts force -F on A.\nCommon student mistakes: Confusing action–reaction with cause–effect (i.e.,\nthinking one causes the other) or stating unequal magnitudes.\nRubric:\n(cid:127) 2 marks for correctly stating the law clearly and unambiguously.\nTotal: 2 marks\nQ3. What is the difference between speed and velocity?\nModel Answer: Speed is a scalar quantity representing how fast an object moves\n(magnitude only). Velocity is a vector quantity representing rate of change of\ndisplacement, i.e., it has both magnitude and direction.\nSteps: Explain that speed = distance/time, velocity = displacement/time; give\na brief example if needed (e.g., 10 km/h east).\nCommon student mistakes: Using 'distance' instead of 'displacement' for\nvelocity or failing to mention direction for velocity.\nRubric:\n(cid:127) 1 mark for correct statement about speed being scalar (magnitude only).\n(cid:127) 1 mark for correct statement about velocity being vector (magnitude and\ndirection) and/or giving the correct formula relation.\nTotal: 2 marks\nTotal Marks for Paper: 6\nAnswer Key — VoidV1 Demo\n",
  "extraction_timestamp": "2025-10-24 13:36:13.028889"
}